Repository: 84000/data-translation-memory
Catalog: toh84_84000-the-questions-of-the-girl-vimalasraddha.tmx
Source language: bo
Languages: en

source: འཕགས་པ་བུ་མོ་རྣམ་དག་དད་པས་ཞུས་པ་ཞེས་བྱ་བ་ཐེག་པ་ཆེན་པོའི་མདོ།
en: The Noble Mahāyāna Sūtra The Questions of the Girl Vimalaśraddhā

source: སངས་རྒྱས་དང་བྱང་ཆུབ་སེམས་དཔའ་ཐམས་ཅད་ལ་ཕྱག་འཚལ་ལོ།
en: Homage to all the buddhas and bodhisattvas!

source: །འདི་སྐད་བདག་གིས་ཐོས་པ་དུས་གཅིག་ན།
en: Thus did I hear at one time.

source: བཅོམ་ལྡན་འདས་མཉན་ཡོད་ན་རྒྱལ་བུ་རྒྱལ་བྱེད་ཀྱི་ཚལ་མགོན་མེད་ཟས་སྦྱིན་གྱི་ཀུན་དགའ་ར་བ་ན་དགེ་སློང་གི་དགེ་འདུན་ཆེན་པོ་ལྔ་བརྒྱ་དང་། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བརྒྱད་སྟོང་དང་ཐབས་ཅིག་ཏུ་བཞུགས་ཏེ། ཐམས་ཅད་ཀྱང་ཤེས་པར་བྱ་བ་རྣམས་རབ་ཏུ་ཤེས་པ། གཟུངས་དང་ཐོགས་པ་མེད་པའི་སྤོབས་པ་ཐོབ་པ། བཟོད་པ་རྣམས་ཕུན་སུམ་ཚོགས་པ། བདུད་ཀྱི་དཔུང་རབ་ཏུ་བཅོམ་པ། དེ་བཞིན་གཤེགས་པ་རྣམས་ཀྱིས་བརྙེས་པའི་ཆོས་རྣམས་རབ་ཏུ་ཐོབ་པ་ཤ་སྟག་ལ་འདི་ལྟ་སྟེ།
en: The Blessed One was residing at Jetavana, Anātha­piṇḍada’s park in Śrāvastī, together with a large assembly of five hundred bhikṣus and eight thousand bodhisattva mahāsattvas who were well versed in all fields of knowledge, had obtained retention and unimpeded eloquence, were fully accomplished in patience, were completely victorious over the hordes of Māra, and had obtained the Dharmas attained by the thus-gone ones.

source: བྱང་ཆུབ་སེམས་དཔའ་འཇིག་རྟེན་འཛིན་དང་། བྱང་ཆུབ་སེམས་དཔའ་ལམ་འཛིན་དང་། བྱང་ཆུབ་སེམས་དཔའ་ས་འཛིན་དང་། བྱང་ཆུབ་སེམས་དཔའ་ས་འཛིན་ཆེན་པོ་དང་། བྱང་ཆུབ་སེམས་དཔའ་མོས་པའི་བློ་གྲོས་དང་། བྱང་ཆུབ་སེམས་དཔའ་མོས་བྱེད་དང་། བྱང་ཆུབ་སེམས་དཔའ་གཟུགས་མཛེས་བཀོད་པ་དང་། བྱང་ཆུབ་སེམས་དཔའ་རིན་པོ་ཆེའི་ཏོག་དང་། བྱང་ཆུབ་སེམས་དཔའ་རིན་པོ་ཆེའི་རྒྱལ་མཚན་དང་། བྱང་ཆུབ་སེམས་དཔའ་རིན་ཆེན་སེམས་པ་དང་། བྱང་ཆུབ་སེམས་དཔའ་རིན་ཆེན་འབྱུང་གནས་དང་། བྱང་ཆུབ་སེམས་དཔའ་རིན་ཆེན་བློ་གྲོས་དང་། བྱང་ཆུབ་སེམས་དཔའ་རིན་ཆེན་ཡོན་ཏན་དང་། བྱང་ཆུབ་སེམས་དཔའ་རིན་ཆེན་འོད་དང་། གཞན་ཡང་བསྐལ་པ་བཟང་པོའི་བྱང་ཆུབ་སེམས་དཔའ་བྱམས་པ་ལ་སོགས་པ་གཙོ་བོར་གྱུར་པ་དང་ཐབས་ཅིག་གོ །གཞན་ཡང་སེམས་པ་དཔེ་ཟླ་མེད་པའི་བྱང་ཆུབ་སེམས་དཔའ་འཇམ་དཔལ་ལ་སོགས་པ་གཙོ་བོར་གྱུར་པ་དྲུག་ཅུ་པོ་དག་དང་ཡང་ཐབས་ཅིག་གོ །གཞན་ཡང་སྐྱེས་བུ་ཆེན་པོ་བྱང་ཆུབ་སེམས་དཔའ་བཟང་སྐྱོང་ལ་སོགས་པ་གཙོ་བོར་གྱུར་པ་བཅུ་དྲུག་དང་ཡང་ཐབས་ཅིག་གོ །གཞན་ཡང་དགའ་ལྡན་གྱི་རིས་ཀྱི་ལྷའི་བུ་ཉི་ཁྲི་འཁོར་དེ་ཉིད་དུ་འདུས་པར་གྱུར་པ་དག་དང་ཡང་ཐབས་ཅིག་གོ །དེའི་ཚེ་བཅོམ་ལྡན་འདས་བཀོད་པ་ཆེན་པོའི་མཛོད་ཅེས་བྱ་བའི་སེང་གེའི་གདན་ལ་འཁོར་བརྒྱ་སྟོང་ཚད་མེད་པ་དག་གིས་ཡོངས་སུ་བསྐོར་ནས་བཞུགས་པས་ཉི་ཟླ་ལྟ་བུའི་འོད་ཟེར་གྱིས་ནི་ཀུན་དུ་སྣང་བར་མཛད།
en: There was the bodhisattva Lokadhara, the bodhisattva Mārgadhara, the bodhisattva Dharaṇīdhara, the bodhisattva Mahādharaṇīdhara, the bodhisattva Dhṛtimati, the bodhisattva Adhimuktika, the bodhisattva Surūpavyūha, the bodhisattva Ratnaketu, the bodhisattva Ratnadhvaja, the bodhisattva Ratnacinta, the bodhisattva Ratnākara, the bodhisattva Ratnamati, the bodhisattva Ratnaguṇa, and the bodhisattva Ratnaprabha, and there were also the bodhisattvas of this fortunate eon headed by Maitreya. There was also a group of sixty bodhisattvas with incomparable motivation, headed by Mañjuśrī, and a group of sixteen great men led by the bodhisattva Bhadrapāla. Also gathered there was an assembly of twenty thousand gods from the Tuṣita heaven. Then the Blessed One, who was sitting there on the lion throne called Treasury of Great Arrangements, surrounded by an immeasurable assembly of hundreds of thousands, shone forth everywhere with rays of light like those of the sun and the moon.

source: བརྒྱ་བྱིན་དང་ཚངས་པའི་རྒྱལ་པོ་ལྟར་གཟི་བྱིན་ནི་ཁྱད་པར་དུ་འཕགས།
en: Like the kings of the gods, Śakra and Brahmā, his brilliance was outstanding.

source: རིའི་རྒྱལ་པོ་རི་རབ་ལྟ་བུར་ཤིན་ཏུ་མཐོ་ཞིང་ཕལ་ལས་ནི་མངོན་པར་འཕགས་པར་གྱུར།
en: Like Mount Meru, the king of mountains, he was extremely tall and rose high above the common.

source: སྒྲོན་མ་ཆེན་པོ་ལྟ་བུར་འོད་ཟེར་དག་ནི་རབ་ཏུ་འབར།
en: Like a great torch, the light that he radiated was utterly resplendent.

source: གླང་པོ་ཆེའི་རྒྱལ་པོ་ལྟར་ཕན་ཚུན་དུ་ནི་གཟིགས་པར་མཛད། སེང་གེའི་སྒྲ་སྒྲོགས་པ་ལྟར་བསྙེངས་པ་མི་མངའ་བར་ནི་ཆོས་སྟོན་པར་མཛད།
en: Like an elephant king, he beheld each one and everyone. Like a lion roaring, he taught the Dharma fearlessly.

source: ལྷ་མ་ཡིན་གྱི་རྒྱལ་པོ་སྒྲ་གཅན་ཟིན་ལྟར་འཁོར་མང་པོ་རྣམས་ནི་ཟིལ་གྱིས་མནན། མཚན་དང་དཔེ་བྱད་བཟང་པོ་དག་གིས་ནི་སྐུ་རབ་ཏུ་བརྒྱན།
en: Like the king of the asuras, Rāhula, he eclipsed all those who surrounded him. His body was adorned with all the major and minor marks of a buddha.

source: གཟི་བྱིན་དང་མཐུ་སྟོབས་དག་ནི་རབ་ཏུ་འབར་བར་གྱུར་ཏེ། སེམས་ཅན་ཐམས་ཅད་ངེས་པའི་དོན་མཆོག་ལ་འགོད་ཅིང་ཁོང་དུ་ཆུད་པར་མཛད་པའི་ཕྱིར་ཚངས་པའི་སྒྲ་དབྱངས་ཀྱིས་སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་ཀུན་ཏུ་བསྒྲགས་ནས་འཁོར་མང་པོའི་དབུས་སུ་ཆོས་སྟོན་པར་མཛད་དོ།
en: His splendor and power blazed forth. In order to establish all sentient beings in the supreme definitive meaning and make them understand it, he was teaching the Dharma in the midst of this large audience with a voice like Brahmā’s, which resounded in all the universes of the entire trichiliocosm.

source: །དེ་ནས་རྒྱལ་པོ་གསལ་རྒྱལ་གྱི་བུ་མོ་རྣམ་དག་དད་པ་ཞེས་བྱ་བ་གཞོན་ནུ་མ་བྱད་བཞིན་སྡུག་ཅིང་མཛེས་པ། སེམས་ཅན་རྣམས་ཀྱིས་མཐོང་བར་མོས་པ། སྔོན་དགེ་བའི་རྩ་བ་བསྐྱེད་པ། ཐེག་པ་ཆེན་པོ་བསྒོམས་པ་ཞིག་ཡོད་པ་དེ་བུ་མོ་གཞོན་ནུ་མ་ལྔ་བརྒྱས་ཡོངས་སུ་བསྐོར་ཏེ། སོ་སོ་ནས་གསེར་གྱི་ཕྲེང་བ་ཐོགས་ནས་གྲོང་ཁྱེར་མཉན་ཡོད་ནས་བྱུང་སྟེ།
en: Then King Prasenajit’s young daughter, Vimalaśraddhā—a pretty and beautiful girl whom everyone liked to see, and who had produced roots of virtue in the past and practiced in the Mahāyāna—came to Jetavana from the town of Śrāvastī, accompanied by five hundred girls, each of whom wore golden jewelry.

source: རྒྱལ་བུ་རྒྱལ་བྱེད་ཀྱི་ཚལ་དུ་ཕྱིན་པ་དང་། བཅོམ་ལྡན་འདས་ཀྱི་ཞབས་ལ་སྤྱི་བོས་གཏུགས་ཏེ་ཕྱག་བྱས་ནས། ལན་གསུམ་བསྐོར་བ་བྱས་ཏེ།
en: Having prostrated herself, bowing her head to the feet of the Blessed One, she circumambulated him three times.

source: བཅོམ་ལྡན་འདས་ཀྱི་སྤྱན་སྔར་ཕྱོགས་གཅིག་ཏུ་འཁོད་ནས་ཚིགས་སུ་བཅད་དེ་མངོན་པར་བསྟོད་པ།
en: Then, after sitting down to one side before the Blessed One, she praised him with these verses:

source: ཡུན་རིང་བསོད་ནམས་རྣམ་དག་ཕྲིན་ལས་བསགས།
en: “For long you accumulated meritorious and pure deeds,

source: །ཡོན་ཏན་རྒྱ་མཚོ་མཐའ་ཡས་ཡོངས་རྫོགས་ཤིང་།
en: And completed an infinite ocean of qualities,

source: །མང་པོ་དད་མོས་དགའ་བར་མཛད་པས་ན།
en: Causing many to rejoice with faith and devotion—

source: །དེ་སླད་ཐུབ་མཆོག་ཁྱོད་ལ་བདག་ཕྱག་འཚལ།
en: For this, I pay homage to you, supreme sage.

source: །གཟི་བྱིན་ལྷམ་མེ་ཡ་མཚན་རབ་སྟོན་ཅིང་།
en: “Displaying a wonderful, luminous resplendence,

source: །རིན་ཆེན་འབྱུང་གནས་ཆོས་སྒོ་སྟོན་པར་མཛད།
en: Like a mine of jewels, you reveal the doorways to the Dharma,

source: །སྐུ་ཡི་འོད་ཟེར་འདོམ་གང་རྟག་གསལ་བ།
en: As a full fathom of light always radiates from your body—

source: །བློ་ཆེན་བསིལ་བའི་རྫིང་ལ་བདག་ཕྱག་འཚལ།
en: For this, I pay homage to you, cool lake of great intelligence.

source: །ཡོན་ཏན་ལྗོན་ཤིང་བསོད་ནམས་བས་མ་འཚལ།
en: “Fruit tree of qualities, inconceivable in virtues,

source: །མི་མཆོག་ཁྱོད་ལ་འཇིག་རྟེན་ཀུན་གྱིས་བསྔགས།
en: The entire world praises you, supreme among humans;

source: །སྨོན་ལམ་ཆེན་པོ་ཚུལ་ཁྲིམས་ཡོངས་རྫོགས་པས།
en: You have perfected discipline and accomplished great aspirations—

source: །དེ་སླད་མཆོད་འོས་གཙོ་ལ་བདག་ཕྱག་འཚལ།
en: For this, I pay homage to you, foremost among those worthy of offerings.

source: །ཆོས་མཆོག་རབ་གནས་རྟག་པར་ཞི་ཞིང་དབེན།
en: “You abide in the supreme Dharma, always calm and unattached.

source: །འཇིག་རྟེན་ཀུན་ལ་ཐུགས་སྙོམས་བུ་གཅིག་བཞིན།
en: You regard every being in the universe with equanimity, as if they were your only child.

source: །མཁྱེན་པ་དག་གིས་སྤྱོད་རྣམས་རབ་མཁྱེན་པས།
en: Since with your dual knowledge you know all actions,

source: །འདྲེན་མཁན་བཞིན་དུ་མཉམ་པའི་ཤུལ་ཡང་སྟོན།
en: Like a skillful guide, you point out the smooth path. “The conduct of bodhisattvas—

source: །རབ་བརྟན་བརྩོན་འགྲུས་ལྡན་པ་མཆིས་གྱུར་ན།
en: Those who, once they have acquired steadfast perseverance,

source: །བྱམས་དང་ཐུགས་རྗེས་སེམས་ཅན་སྨན་མཛད་པས། །བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་གང་ལགས་པ།
en: Act to benefit all sentient beings with love and compassion—

source: །དེ་བཞིན་གཤེགས་པས་བཀས་ནི་བཤད་དུ་གསོལ།
en: I request that the Thus-Gone One teach and explain.

source: །ཇི་ལྟར་རབ་བརྟན་སྟོབས་ནི་ཐོབ་གྱུར་ནས།
en: “How, having obtained steadfast strength,

source: །འཁོར་བར་གནས་ཀྱང་བདུད་དཔུང་ཕམ་བགྱིད་ལགས།
en: Do bodhisattvas defeat the hordes of Māra, yet remain within saṃsāra?

source: །ཇི་ལྟར་མཉམ་པའི་ཆོས་ནི་ཐོབ་འགྱུར་ཞིང་།
en: How, having obtained the Dharma of equanimity,

source: །ཇི་ལྟར་སེམས་ཅན་ཡོངས་སུ་སྨིན་བགྱིད་ལགས།
en: Do they bring sentient beings to maturity?

source: །ཇི་ལྟར་བགྱིས་ན་ས་གཞི་ནམ་མཁའ་དང་། །རླུང་དང་ཆུ་མེ་ཇི་ལྟ་བཞིན་དུ་འགྱུར།
en: “How are they like the earth and the sky, Like the wind, like water, and like fire?

source: །ཇི་ལྟར་ཡིད་ཆེས་ཐོབ་ནས་ཆོས་གནས་ཤིང་།
en: How, having obtained trust in it, do they abide in the Dharma,

source: །རི་རབ་སེང་གེའི་རྒྱལ་པོ་བཞིན་དུ་འགྱུར།
en: Becoming like Mount Meru or a lion king?

source: །ཇི་ལྟར་བྱམས་སྡང་སེམས་ནི་ཡོངས་སྤངས་ནས།
en: “How, having abandoned a mind of love and hate,

source: །སེམས་གཙང་དྲང་ལ་གཡོ་སྒྱུ་མ་མཆིས་འགྱུར།
en: Do their minds become pure, honest, and nondeceptive?

source: །ཇི་ལྟར་སྦྱིན་དང་ཚུལ་ཁྲིམས་བཟོད་པ་དང་། །བརྩོན་འགྲུས་བསམ་གཏན་རྣམ་གྲོལ་སྐྱེ་འགྱུར་ཞིང་།
en: How do they cultivate generosity, discipline, patience, Perseverance, concentration, and liberation?

source: །ཤེས་རབ་ཉོན་མོངས་མུན་པ་རབ་བཅོམ་ནས།
en: “How do they vanquish the darkness of the afflictions with their insight,

source: །རྟག་པར་ཐབས་ཆེན་ལ་ནི་གནས་པ་དང་། །ཏིང་འཛིན་གཟུངས་ལ་ཐོགས་པ་མ་མཆིས་ཤིང་།
en: And how, constantly applying great means, Do they abide in unimpeded retention and concentration,

source: །ཚད་མེད་བཞི་དང་མངོན་ཤེས་ལྔ་ལ་གནས།
en: The four immeasurables, and the five kinds of supernormal powers?

source: །ཇི་ལྟར་སངས་རྒྱས་སྤྱན་སྔར་གནས་གྱུར་ནས།
en: “How, having come into the presence of the buddhas,

source: །རྟག་པར་རྫུས་ཏེ་སྐྱེ་ཞིང་ཚེ་རབས་དྲན།
en: Do they always take miraculous births, remembering their previous lives?

source: །སྦྱངས་པས་རྩོད་པ་མ་མཆིས་དགོན་གནས་ནས།
en: Practicing austerities, they dwell in hermitages without strife,

source: །སེམས་ནི་རབ་བཏུལ་ཉོན་མོངས་ཞི་བགྱིད་དང་། །ཚུལ་ཁྲིམས་ལྡན་ཞིང་བྱང་ཆུབ་ལམ་བསྒོམས་དང་། །བདུད་རྩི་འགོག་ཐོབ་བདུད་དཔུང་འཇོམས་པ་དང་། །བདེ་སྩོལ་ཆོས་ཀྱི་འཁོར་ལོ་སྐོར་འགྱུར་བ།
en: Taming their minds and pacifying the afflictions. “Following discipline, they cultivate the path of awakening. And, having obtained the nectar of cessation, they defeat the armies of Māra, And turn the Wheel of Dharma that confers bliss—

source: །དེ་འདྲའི་ཡང་དག་ལམ་ནི་བཀས་བཤད་གསོལ།
en: I beseech you to explain in words such a perfect path!”

source: །དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་བུ་མོ་རྣམ་དག་དད་པ་ལ་བཀའ་སྩལ་པ། བུ་མོ་བྱང་ཆུབ་སེམས་དཔའ་གང་སྟོབས་རྣམ་པ་བརྒྱད་དང་ལྡན་པར་གྱུར་ན་འཁོར་བ་ན་གནས་ཀྱང་རབ་ཏུ་བརྟན་པའི་དཔའ་བོར་འགྱུར་ཞིང་ཡོངས་སུ་ངལ་བ་མེད་པར་འགྱུར་རོ།
en: Then the Blessed One replied to the girl Vimalaśraddhā, “Girl, if bodhisattvas are endowed with eight strengths, although dwelling within saṃsāra, they have steadfast courage and are completely indefatigable.

source: །བརྒྱད་གང་ཞེ་ན།
en: And what are these eight strengths?

source: དང་པོ་ནི་སེམས་ཀྱིས་འདུན་པའི་སྟོབས་ཏེ་གཡོ་སྒྱུ་མེད་པའི་ཕྱིར་རོ།
en: The first is the strength of mental motivation, because they are without deceit.

source: །གཉིས་པ་ནི་མོས་པའི་སྟོབས་ཏེ། སྡིག་པ་རྣམས་སྤོང་བར་བྱེད་པའི་ཕྱིར་རོ།
en: The second is the strength of determination, because they abandon all faults.

source: །གསུམ་པ་ནི་སྦྱོར་བའི་སྟོབས་ཏེ། རྟག་ཏུ་དགེ་བ་བསྒྲུབ་པའི་ཕྱིར་རོ།
en: The third is the strength of application, because they continually practice virtue.

source: །བཞི་པ་ནི་མངོན་པར་ཡིད་ཆེས་པའི་སྟོབས་ཏེ། ལས་ཀྱི་རྣམ་པར་སྨིན་པ་དག་ལ་ཤིན་ཏུ་མངོན་པར་ཡིད་ཆེས་པའི་ཕྱིར་རོ།
en: The fourth is the strength of real trust, because they have strong trust in the maturation of karma.

source: །ལྔ་པ་ནི་བྱང་ཆུབ་ཀྱི་སེམས་ཀྱི་སྟོབས་ཏེ། ཐེག་པ་དམན་པ་ཡོངས་སུ་མི་ཚོལ་བའི་ཕྱིར་རོ།
en: The fifth is the strength of the mind set on awakening, because they do not seek out inferior vehicles.

source: །དྲུག་པ་ནི་བྱམས་པ་ཆེན་པོའི་སྟོབས་ཏེ། སེམས་ཅན་ལ་གནོད་པ་མེད་པའི་ཕྱིར་རོ།
en: The sixth is the strength of great love, because they do not harm sentient beings.

source: །བདུན་པ་ནི་སྙིང་རྗེ་ཆེན་པོའི་སྟོབས་ཏེ་གནོད་པ་བྱས་པ་རྣམས་དང་དུ་ལེན་པར་བྱེད་པའི་ཕྱིར་རོ།
en: The seventh is the strength of great compassion, because they take all injury upon themselves.

source: །བརྒྱད་པ་ནི་དགེ་བའི་བཤེས་གཉེན་གྱི་སྟོབས་ཏེ། དུས་དུས་སུ་སད་པར་བྱེད་པའི་ཕྱིར་རོ། །བུ་མོ་འདི་ནི་སྟོབས་རྣམ་པ་བརྒྱད་ཅེས་བྱ་སྟེ།
en: The eighth is the strength of a spiritual friend, because from time to time they need to be examined. Girl, these are called the eight kinds of strength.

source: བྱང་ཆུབ་སེམས་དཔའ་གང་སྟོབས་བརྒྱད་པོ་འདི་དག་དང་ལྡན་པར་གྱུར་ན་རབ་ཏུ་བསྟན་པའི་དཔའ་བོར་འགྱུར་བས་འཁོར་བ་ན་གནས་ཀྱང་མངོན་པར་ཞེན་ཅིང་ཆགས་པ་མེད་པར་འགྱུར་རོ།
en: When bodhisattvas are endowed with these eight strengths, they have steadfast courage, and although they dwell within saṃsāra, they have no clinging or attachment.”

source: །དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་ཡང་ཚིགས་སུ་བཅད་དེ་བཀའ་སྩལ་པ།
en: Then the Blessed One spoke again in verse:

source: སེམས་འདུན་དཔའ་བོ་གང་ཡིན་པ།
en: “Heroic ones with motivated minds

source: །གཡོ་སྒྱུ་དག་ནི་སྤོང་བྱེད་ཅིང་།
en: Abandon any deceit,

source: །རྟག་པར་དྲང་པོར་སྤྱོད་པས་ན།
en: And, always behaving in a straightforward manner,

source: །ཡང་དག་བྱང་ཆུབ་གཞོལ་བར་འགྱུར།
en: Apply themselves diligently to genuine awakening.

source: །མོས་པའི་སྟོབས་ནི་གང་ཡིན་པ།
en: “One who has the strength of determination

source: །ཉེས་པ་མང་པོ་སྤོང་བྱེད་ཅིང་།
en: Abandons the various faults,

source: །དགེ་བ་འབའ་ཞིག་སྤྱོད་པས་ན།
en: And, practicing virtue exclusively,

source: །ཡང་དག་བརྩོན་ལ་གནས་པར་འགྱུར།
en: Maintains genuine diligence.

source: །སྦྱོར་བ་ཕུན་སུམ་ཚོགས་གྱུར་པ།
en: “One who is endowed with application

source: །རྟག་ཏུ་ལེགས་པར་རབ་བསྟན་ནས།
en: Is always excellently stable,

source: །བརྩོན་འགྲུས་བརྟན་པར་གྱུར་པས་ན།
en: And, having steadfast perseverance,

source: །སེམས་ཅན་རྣམས་ནི་བདེ་བར་བྱེད།
en: Brings happiness to sentient beings.

source: །མངོན་པར་ཡིད་ཆེས་སྟོབས་དབང་གིས།
en: “Through the power of real trust,

source: །ལས་ཀྱི་རྣམ་སྨིན་རིག་པས་ན།
en: If one is aware of the full maturation of karma,

source: །སངས་རྒྱས་ཡེ་ཤེས་ཡིད་ཆེས་ཤིང་།
en: One has confidence in the Buddha’s wisdom

source: །འཇིག་རྟེན་ཡོངས་སུ་སྡུད་པར་འགྱུར།
en: And brings the entire universe under one’s care.

source: །བྱང་ཆུབ་སེམས་སྟོབས་གང་ཡིན་དེས།
en: “One who has the strength of the mind set on awakening

source: །ཐེག་པ་དམན་པ་སྤོང་བྱེད་ཅིང་།
en: Abandons the inferior vehicles,

source: །སངས་རྒྱས་གདུང་ནི་མི་གཅོད་པས།
en: And, not interrupting the lineage of the buddhas,

source: །ཆོས་ཉིད་ལ་ནི་གནས་པར་འགྱུར།
en: Abides in the true nature of things.

source: །བྱམས་ཆེན་སྟོབས་ཀྱི་དབང་གིས་ནི།
en: “Through the power of great loving-kindness,

source: །སེམས་ཅན་སྙོམས་པར་ལྟ་བྱེད་ཅིང་།
en: One looks with equality at all sentient beings

source: །བྱམས་སྡང་དག་ནི་མེད་པས་ན།
en: And, being beyond love and hate,

source: །ཞེ་སྡང་གནོད་སེམས་སྐྱེད་མི་འགྱུར།
en: Does not give rise to anger or ill will.

source: །སྙིང་རྗེ་ཆེན་པོའི་སྟོབས་ཀྱིས་ནི།
en: “Through the strength of great compassion,

source: །སེམས་ཅན་དང་དུ་ལེན་བྱེད་ཅིང་།
en: One takes responsibility for sentient beings

source: །འཁོར་བ་དག་ལ་ཞེན་མེད་པས།
en: And, not clinging to saṃsāra,

source: །ཡོངས་སུ་སྐྱོ་ཞིང་ངལ་བ་མེད།
en: Does not feel disenchanted or weary.

source: །དགེ་བའི་བཤེས་གཉེན་སྟོབས་ཀྱིས་ནི།
en: “Through the strength of the spiritual friend,

source: །རྟག་པར་ཕན་ཚུན་སད་བྱེད་ཅིང་།
en: There is continuous examination of each other.

source: །སེམས་ནི་བྱིང་བར་མི་འགྱུར་བས།
en: One will not lose heart,

source: །བྱང་ཆུབ་ལ་ནི་གནས་པར་འགྱུར།
en: And so will abide in awakening.

source: །དཔའ་བོ་གང་ཡིན་དེ་དག་གིས།
en: “When those who are heroes

source: །སྟོབས་བརྒྱད་འདི་དག་ཐོབ་གྱུར་ན།
en: Have obtained these eight strengths,

source: །བྱང་ཆུབ་སྙིང་པོར་འདུག་ནས་ནི།
en: They will reside in the heart of awakening

source: །བདུད་དཔུང་མང་པོ་བཅོམ་པར་འགྱུར།
en: And defeat the many armies of Māra.

source: །གཞན་ཡང་བུ་མོ་བྱང་ཆུབ་སེམས་དཔའ་ཆོས་རྣམ་པ་བརྒྱད་དང་ལྡན་པར་གྱུར་ན་མཉམ་པ་ཉིད་ལ་རབ་ཏུ་གནས་པར་འགྱུར་རོ།
en: “Furthermore, girl, when bodhisattvas are endowed with eight qualities, they abide in sameness.

source: །བརྒྱད་གང་ཞེ་ན་དང་པོ་ནི་སེམས་ཅན་ཐམས་ཅད་མཉམ་པར་གྱུར་པ་སྟེ་རང་བཞིན་གྱིས་བདག་མེད་པའི་ཕྱིར་རོ།
en: What are these eight qualities? The first is the sameness of all sentient beings, because they are intrinsically without a self.

source: །གཉིས་པ་ནི་ཆོས་ཐམས་ཅད་མཉམ་པར་གྱུར་པ་སྟེ་ཆོས་རྣམས་རབ་ཏུ་དབེན་པའི་ཕྱིར་རོ།
en: The second is the sameness of all phenomena, because they are utterly void.

source: །གསུམ་པ་ནི་ཞིང་ཐམས་ཅད་མཉམ་པར་གྱུར་པ་སྟེ། སྟོང་པ་ཉིད་ཀྱི་ཁམས་སུ་འཇུག་པར་འགྱུར་བའི་ཕྱིར་རོ།
en: The third is the sameness of all buddhafields, because they all occur within the sphere of emptiness.

source: །བཞི་པ་ནི་དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་མཉམ་པར་གྱུར་པ་སྟེ། སྙོམས་པ་ཉིད་དུ་སྟོན་པའི་ཕྱིར་རོ།
en: The fourth is the sameness of all thus-gone ones, because they all teach in equanimity.

source: །ལྔ་པ་ནི་སྤྱོད་པ་ཐམས་ཅད་མཉམ་པར་གྱུར་པ་སྟེ། རྒྱུ་དང་རྐྱེན་ལ་རང་བཞིན་མེད་པའི་ཕྱིར་རོ།
en: The fifth is the sameness of all actions, because causes and conditions are without intrinsic nature.

source: །དྲུག་པ་ནི་ཐེག་པ་ཐམས་ཅད་མཉམ་པར་གྱུར་པ་སྟེ། འདུས་མ་བྱས་སུ་མཚུངས་པའི་ཕྱིར་རོ།
en: The sixth is the sameness of all vehicles, because they are all similar in being noncomposite.

source: །བདུན་པ་ནི་སེམས་མཉམ་པར་གྱུར་པ་སྟེ། སེམས་སྒྱུ་མ་དང་མཚུངས་པའི་ཕྱིར་རོ།
en: The seventh is the sameness of minds, because mind is similar to an illusion.

source: །བརྒྱད་པ་ནི་བདུད་རྣམས་མཉམ་པར་གྱུར་པ་སྟེ། ཉོན་མོངས་པའི་ཐོག་མ་མི་དམིགས་པའི་ཕྱིར་རོ།
en: The eighth is the sameness of all māras, because one cannot observe a beginning of the afflictions.

source: །འདི་ནི་ཆོས་རྣམ་པ་བརྒྱད་ཀྱིས་མཉམ་པ་ཉིད་ལ་རབ་ཏུ་གནས་པ་ཞེས་བྱའོ།
en: This is what is called abiding in sameness through the eight qualities.”

source: སེམས་ཅན་རང་བཞིན་བདག་མེད་པས།
en: “Because sentient beings are intrinsically without a self,

source: །སྐད་ཅིག་ཙམ་ཡང་དམིགས་མི་འགྱུར།
en: They cannot be observed even for a moment.

source: །མཉམ་པ་ཉིད་ལ་གང་གནས་པ།
en: One who abides in sameness

source: །དེ་ལྟ་བུར་ནི་བལྟ་བར་བྱ།
en: Should see in this way.

source: །ཆོས་རྣམས་ཐམས་ཅད་མཉམ་པས་ན།
en: “Because all phenomena are the same,

source: །རང་བཞིན་རྟག་པར་སྟོང་ཞིང་དབེན།
en: They are always intrinsically empty and void.

source: །ཡི་གེས་ཐ་དད་ཕྱེ་བར་ཟད།
en: Differentiated only through words,

source: །ཆོས་རྣམས་རང་བཞིན་བྱེ་བྲག་མེད།
en: Phenomena are intrinsically without particularity. “As one cannot observe any boundaries

source: །ཕྱོགས་བཅུའི་ཞིང་རྣམས་ཐམས་ཅད་ཀུན། །མུ་མཐའ་དག་ནི་མི་དམིགས་པས།
en: Of all the buddhafields in the ten directions,

source: །དེ་ཡི་རང་བཞིན་ནམ་མཁའ་འདྲ།
en: Their nature is similar to space—

source: །སངས་རྒྱས་ཞིང་ནི་རྟག་ཏུ་མཉམ།
en: All the buddhafields are always the same.

source: །དུས་གསུམ་དེ་བཞིན་གཤེགས་པ་ཀུན།
en: “As all thus-gone ones of the three times

source: །ཆོས་དབྱིངས་གནས་པར་མཉམ་པས་ན།
en: Are the same in their abiding in the expanse of reality,

source: །ཡེ་ཤེས་མཐའ་ཡས་རྣམ་པར་གྲོལ།
en: They are completely free through their unending wisdom—

source: །སངས་རྒྱས་ཀུན་ཀྱང་དེ་བཞིན་ནོ།
en: All buddhas are such.

source: །སེམས་ཅན་རང་བཞིན་རྒྱུ་རྐྱེན་རྣམས།
en: “The causes and conditions of sentient beings

source: །ཐམས་ཅད་ཀུན་ཀྱང་མཉམ་པ་དང་། །དེ་ཡི་སྤྱོད་པ་རབ་ཤེས་པས།
en: In their nature are all the same. By knowing their actions,

source: །ཅི་རིགས་པར་ནི་གོ་བར་བྱེད།
en: One understands them accordingly.

source: །སེམས་ཅན་ཇི་སྙེད་ཐ་དད་པ།
en: “All the different sentient beings

source: །སྒྱུ་སྦྲུལ་ལྟ་བུར་རབ་ཏུ་རྟོགས།
en: Are understood to be like an illusory display.

source: །ཕྱི་ནང་གཉིས་ཀ་ལེན་མེད་པས།
en: Not grasping at either the inner or the outer,

source: །རང་བཞིན་རྟག་ཏུ་རྣམ་པར་དག །ཐེག་པ་སྣ་ཚོགས་རབ་བཤད་ཀྱང་།
en: Their nature is always pure. “Although various vehicles were taught,

source: །འདུས་མ་བྱས་སུ་རབ་ཏུ་མཉམ།
en: They are the same in being noncomposite.

source: །འདྲེན་པས་ཐབས་ནི་རབ་མཁྱེན་པས།
en: In full knowledge of means, the Guide

source: །རྣམ་པར་ཕྱེ་སྟེ་ཐེག་གསུམ་བཤད།
en: Made distinctions by teaching three vehicles.

source: །ཉོན་མོངས་བདུད་ལ་རབ་གནས་ཀྱང་།
en: “Even when the māra of afflictions is at hand,

source: །ཉོན་མོངས་དངོས་པོ་ཅི་ཡང་མེད།
en: The afflictions are not at all existing things. Similarly, the domains of the māra of the gods,

source: །ལྷ་དང་ཕུང་པོ་འཆི་བདག་བདུད། །སྤྱོད་ཡུལ་ཐམས་ཅད་སྟོང་པ་ཡིན།
en: The māra of the aggregates, and the māra of the Lord of Death are empty.

source: །གཞན་ཡང་བུ་མོ་བྱང་ཆུབ་སེམས་དཔའ་ཆོས་བརྒྱད་དང་ལྡན་ན་བྱམས་སྡང་རྣམས་ཡོངས་སུ་སྤོང་བར་བྱེད་དོ།
en: “Furthermore, girl, when bodhisattvas are endowed with eight qualities, they abandon love and hate.

source: །བརྒྱད་གང་ཞེ་ན་བྱམས་པ་དང་ལྡན་པ་དང་། སྙིང་རྗེ་དང་ལྡན་པ་དང་། རྟག་པར་ཕན་འདོགས་པར་བྱེད་པ་དང་། འཇིག་རྟེན་པའི་ཆོས་ལ་མ་ཆགས་པ་དང་། རང་གི་ལུས་ལ་ཆགས་པ་མེད་པ་དང་། རྟག་ཏུ་ཏིང་ངེ་འཛིན་གྱི་སེམས་སྒོམ་པ་དང་། ལུས་དང་སྲོག་ཡོངས་སུ་གཏོང་བ་དང་། ཉོན་མོངས་པ་རྣམས་ལ་སོ་སོར་རྟོག་པ་སྟེ།
en: What are these eight qualities? Being endowed with love; being endowed with compassion; always being willing to benefit others; not being attached to worldly things; not being attached to one’s body; always cultivating a concentrated mind; giving away one’s body and life;

source: ཆོས་བརྒྱད་པོ་འདི་དག་མངོན་པར་སྒྲུབ་པར་ནུས་ན་བྱམས་སྡང་ཡོངས་སུ་སྤོང་བར་འགྱུར་རོ།
en: and discerning the afflictions. When bodhisattvas can accomplish these eight qualities, they will abandon love and hate.”

source: བྱམས་སེམས་གོ་ཆ་རབ་བགོས་ནས།
en: “Bearing the armor of a loving mind,

source: །ཐམས་ཅད་ཀུན་ལ་སྙིང་བརྩེ་ཞིང་།
en: One has affectionate concern for everyone,

source: །མཉམ་པའི་སེམས་ལ་གང་གནས་པ།
en: And, maintaining equality,

source: །བྱམས་སྡང་སེམས་ལ་སྐྱེ་མི་འགྱུར།
en: Love and hate do not arise.

source: །བློ་ལྡན་ཕན་འདོགས་སྤྱོད་པས་ན།
en: “Because wise people always act to be of benefit,

source: །རྟག་པར་གཞན་ལ་བདེ་བ་གཏོང་།
en: They constantly give happiness to others;

source: །རྙེད་པ་ཐོབ་ཀྱང་རང་མི་མཐོང་།
en: Although they acquire something, they do not see it as their own,

source: །བརྙས་ཤིང་སྨད་ཀྱང་འཁོན་འཛིན་མེད།
en: And they hold no resentment despite being blamed or disparaged.

source: །རླུང་བརྒྱད་ཀྱིས་ནི་མི་བསྐྱོད་པས།
en: “Since they are unshaken by the eight worldly concerns,

source: །བྱམས་སྡང་དག་ནི་མི་སྐྱེ་ཞིང་།
en: Love and hate do not arise.

source: །བདག་གམ་གལ་ཏེ་གཞན་ཡང་རུང་།
en: Whether it concerns themselves or others,

source: །བྱམས་སྡང་འདུ་ཤེས་ཡོངས་མི་སྐྱེད།
en: Conceptions of love and hate do not arise.

source: །འདུ་ཤེས་རྣམས་ནི་རབ་སྤངས་ནས།
en: “Having abandoned all conceptions,

source: །སྤྱོད་ཡུལ་དག་ལ་ཞེན་པ་མེད།
en: Such people do not cling to any objects of experience.

source: །རྟག་པར་རང་གི་ལུས་རྟོགས་པས།
en: Always understanding the nature of the body,

source: །ལུས་སྲོག་དག་ལ་ཕོངས་པ་མེད། །མཁས་རྣམས་སྡུག་བསྔལ་བདེ་བ་ཡིས།
en: They have no distress about their bodies or lives.

source: །གཡོས་པར་མི་འགྱུར་ནམ་མཁའ་བཞིན།
en: “Sagacious beings, like the sky, Are unmoved by joys and sorrows,

source: །ཉོན་མོངས་ལེགས་པར་རྟོགས་བྱེད་ན།
en: And, properly understanding the afflictions,

source: །བདག་དང་བདག་གི་གཉི་ག་སྤོང་།
en: Avoid both me and mine

source: །སྤྱོད་འཛིན་རྟག་པར་ས་འདྲ་བས།
en: “Being like the earth in always accepting all activity,

source: །བྱམས་སྡང་དག་ནི་ཡོངས་མི་སྐྱེད།
en: Love and hate do not arise.

source: །གཞན་ཡང་བུ་མོ་བྱང་ཆུབ་སེམས་དཔའ་ཆོས་རྣམ་པ་བརྒྱད་དང་ལྡན་ན་འཁོར་བས་ཡོངས་སུ་ངལ་བར་མི་འགྱུར་རོ། །བརྒྱད་གང་ཞེ་ན།
en: “Furthermore, girl, when bodhisattvas are endowed with eight qualities, they do not become exhausted by saṃsāra. What are these eight qualities? Bodhisattvas do not become exhausted by saṃsāra because their roots of virtue are immensely vast; because they discern sentient beings; because they always see and make offerings to the thus-gone ones;
